_____________________________________________________________________________________________________________________________
Layer (type)                                            Output Shape                                      Param #            
=============================================================================================================================
input_1 (InputLayer)                                    (None, 13, 32, 32, 2)                             0                  
_____________________________________________________________________________________________________________________________
bidirectional_1 (Bidirectional)                         (None, 13, 32, 32, 256)                           1199104            
_____________________________________________________________________________________________________________________________
time_distributed_1 (TimeDistributed)                    (None, 13, 32, 32, 14)                            3598               
_____________________________________________________________________________________________________________________________
batch_normalization_1 (BatchNormalization)              (None, 13, 32, 32, 14)                            56                 
_____________________________________________________________________________________________________________________________
activation_1 (Activation)                               (None, 13, 32, 32, 14)                            0                  
=============================================================================================================================
Total params: 1,202,758
Trainable params: 1,202,730
Non-trainable params: 28
_____________________________________________________________________________________________________________________________
